In [2]:
import pandas as pd

In [3]:
ls

Combine All Data.ipynb            output_clean_q3_header.csv
bus_company_monday.csv            output_clean_q4_header.csv
metronorth_monday.csv             output_raw.csv
output_clean.csv                  path_monday.csv
output_clean_q1.csv               taxiBusSubwayFerryBikeAmtrak.csv
output_clean_q2_header.csv        waterways_monday.csv

In [9]:
bus_company = pd.read_csv("bus_company_monday.csv")

In [10]:
metronorth = pd.read_csv("metronorth_monday.csv")

In [11]:
path = pd.read_csv("path_monday.csv")

In [12]:
waterways = pd.read_csv("waterways_monday.csv")

In [13]:
taxiBusSubwayFerryBikeAmtrak = pd.read_csv("taxiBusSubwayFerryBikeAmtrak.csv")

In [14]:
output = pd.concat([bus_company, metronorth, path, waterways, taxiBusSubwayFerryBikeAmtrak])

In [15]:
output.head()

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
0,13,2015-01-05 00:00:00,2015-01-05 00:00:29,29,40.731841,-73.805384,40.732107,-73.808141
1,13,2015-01-05 00:00:00,2015-01-05 00:01:11,71,40.773573,-73.893290,40.772406,-73.895761
2,13,2015-01-05 00:00:00,2015-01-05 00:00:09,9,40.770302,-73.875496,40.770078,-73.876107
3,13,2015-01-05 00:00:00,2015-01-05 00:01:15,75,40.759351,-73.830739,40.762739,-73.831742
4,13,2015-01-05 00:00:00,2015-01-05 00:04:00,240,40.745603,-73.902741,40.746288,-73.890604

In [16]:
output.shape

(4699024, 8)

In [17]:
output = output[output.tripduration != 0]
output = output[output.start_lat != 0]
output = output[output.end_lat != 0]
output = output.sort_values(by=['starttime', 'type_id'])
output = output.reset_index(drop=True)

In [18]:
output.shape

(4699024, 8)

In [19]:
output.head()

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
0,1,2015-01-05 00:00:00,2015-01-05 00:09:43,583,40.686058,-73.990952,40.677547,-73.938622
1,2,2015-01-05 00:00:00,2015-01-05 00:06:44,404,40.723946,-73.951294,40.697411,-73.964851
2,3,2015-01-05 00:00:00,2015-01-05 00:01:09,69,40.642979,-73.878334,40.645187,-73.878555
3,3,2015-01-05 00:00:00,2015-01-05 00:01:09,69,40.642979,-73.878334,40.645187,-73.878555
4,3,2015-01-05 00:00:00,2015-01-05 00:00:23,23,40.645714,-73.902313,40.644871,-73.902176

In [20]:
output.tail()

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
4699019,4,2015-01-06 04:42:13,2015-01-06 04:42:47,34,40.711842,-73.790161,40.710716,-73.793091
4699020,4,2015-01-06 04:42:47,2015-01-06 04:44:00,73,40.710716,-73.793091,40.707237,-73.794998
4699021,4,2015-01-06 04:42:47,2015-01-06 04:44:00,73,40.710716,-73.793091,40.707237,-73.794998
4699022,4,2015-01-06 04:44:00,2015-01-06 04:45:00,60,40.707237,-73.794998,40.704933,-73.793320
4699023,4,2015-01-06 04:44:00,2015-01-06 04:45:00,60,40.707237,-73.794998,40.704933,-73.793320

In [22]:
output.starttime = pd.to_datetime(output.starttime)

In [23]:
output.stoptime = pd.to_datetime(output.stoptime)

In [15]:
output.to_csv("output_raw.csv")

In [16]:
%%bash
awk -F"," -v OFS="," '{ $1="" ; $0=substr($0,2) } 1' output_raw.csv > output_clean.csv

In [29]:
%%bash
head output_clean.csv

type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
1,2015-01-05 00:00:00,2015-01-05 00:09:43,583,40.6860580444,-73.9909515381,40.6775474548,-73.938621521
2,2015-01-05 00:00:00,2015-01-05 00:06:44,404,40.7239456177,-73.9512939453,40.6974105835,-73.9648513794
3,2015-01-05 00:00:00,2015-01-05 00:01:09,69,40.642979,-73.878334,40.645187,-73.878555
3,2015-01-05 00:00:00,2015-01-05 00:01:09,69,40.642979,-73.878334,40.645187,-73.878555
3,2015-01-05 00:00:00,2015-01-05 00:00:23,23,40.645714,-73.902313,40.644871,-73.902176
3,2015-01-05 00:00:00,2015-01-05 00:01:09,69,40.642979,-73.878334,40.645187,-73.878555
3,2015-01-05 00:00:00,2015-01-05 00:00:48,48,40.748638,-73.938446,40.747673,-73.941116
3,2015-01-05 00:00:00,2015-01-05 00:00:48,48,40.748638,-73.938446,40.747673,-73.941116
3,2015-01-05 00:00:00,2015-01-05 00:00:48,48,40.748638,-73.938446,40.747673,-73.941116

In [30]:
%%bash
awk '{n+=1} END {print n}' output_clean.csv

4699025

In [32]:
4699024 / 2

2349512

In [33]:
%%bash
head -n 2500000 output_clean.csv > output_clean_h1.csv

In [34]:
%%bash
tail -n 2500000 output_clean.csv > output_clean_h2.csv

In [35]:
%%bash
head -n 1450000 output_clean_h1.csv > output_clean_q1.csv

In [36]:
%%bash
tail -n 1450000 output_clean_h1.csv > output_clean_q2.csv
# add header back in
for csv in output_clean_q2.csv; do (echo "type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon"; cat output_clean_q2.csv) > tmp; mv tmp output_clean_q2_header.csv; done

In [37]:
%%bash
head -n 1450000 output_clean_h2.csv > output_clean_q3.csv
# add header back in
for csv in output_clean_q3.csv; do (echo "type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon"; cat output_clean_q3.csv) > tmp; mv tmp output_clean_q3_header.csv; done

In [38]:
%%bash
tail -n 1450000 output_clean_h2.csv > output_clean_q4.csv
# add header back in
for csv in output_clean_q4.csv; do (echo "type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon"; cat output_clean_q4.csv) > tmp; mv tmp output_clean_q4_header.csv; done

Rename image files:

In [ ]:
%%bash

num=900; for i in *.tiff; do mv "$i" "$(printf '%06d' $num).${i#*.}"; ((num++)); done

In [ ]:
%%bash

num=1800; for i in *.tiff; do mv "$i" "$(printf '%06d' $num).${i#*.}"; ((num++)); done

Try splitting output file based on time rather than number of rows.

12am - 6am,

6am - 12pm,

12pm - 6pm,

6pm - 12am

To allow for some wiggle room...

12am - 8am,

6am - 2pm,

12pm - 8pm,

6pm - 2am

In [29]:
output_q1 = output[output.starttime >= pd.to_datetime('2015-01-05 00:00:00')][output.starttime < pd.to_datetime('2015-01-05 08:00:00')]
output_q1.tail()

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
783505,7,2015-01-05 07:59:59,2015-01-05 08:04:00,241,40.737930,-73.996346,40.741528,-73.989777
783506,13,2015-01-05 07:59:59,2015-01-05 08:01:09,70,40.727153,-73.846460,40.728888,-73.847389
783507,13,2015-01-05 07:59:59,2015-01-05 08:00:50,51,40.765819,-73.864246,40.764312,-73.862806
783508,13,2015-01-05 07:59:59,2015-01-05 08:01:13,74,40.713231,-73.903961,40.713987,-73.902349
783509,13,2015-01-05 07:59:59,2015-01-05 08:00:32,33,40.674307,-73.799117,40.674451,-73.800602

In [31]:
output_q2 = output[output.starttime >= pd.to_datetime('2015-01-05 06:00:00')][output.starttime < pd.to_datetime('2015-01-05 14:00:00')]
output_q2.tail()

/Users/Will/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  if __name__ == '__main__':

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
2229313,7,2015-01-05 13:59:59,2015-01-05 14:01:08,69,40.635010,-74.132408,40.636597,-74.134224
2229314,7,2015-01-05 13:59:59,2015-01-05 14:02:00,121,40.583580,-74.073128,40.590076,-74.066795
2229315,7,2015-01-05 13:59:59,2015-01-05 14:00:40,41,40.615307,-74.073448,40.613789,-74.072304
2229316,7,2015-01-05 13:59:59,2015-01-05 14:00:26,27,40.558010,-74.126335,40.559101,-74.125153
2229317,13,2015-01-05 13:59:59,2015-01-05 14:01:05,66,40.606777,-73.819329,40.611468,-73.819011

In [32]:
output_q3 = output[output.starttime >= pd.to_datetime('2015-01-05 12:00:00')][output.starttime < pd.to_datetime('2015-01-05 20:00:00')]
output_q3.tail()

/Users/Will/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  if __name__ == '__main__':

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
3872702,13,2015-01-05 19:59:59,2015-01-05 20:01:00,61,40.772580,-73.895658,40.774158,-73.893644
3872703,13,2015-01-05 19:59:59,2015-01-05 20:00:46,47,40.689655,-73.850250,40.688266,-73.849243
3872704,13,2015-01-05 19:59:59,2015-01-05 20:00:45,46,40.752434,-73.879283,40.752228,-73.881181
3872705,13,2015-01-05 19:59:59,2015-01-05 20:01:39,100,40.706965,-73.897269,40.703742,-73.895737
3872706,13,2015-01-05 19:59:59,2015-01-05 20:00:34,35,40.768610,-73.892268,40.768743,-73.890445

In [33]:
output_q4 = output[output.starttime >= pd.to_datetime('2015-01-05 18:00:00')][output.starttime < pd.to_datetime('2015-01-06 02:00:00')]
output_q4.tail()

/Users/Will/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  if __name__ == '__main__':

,type_id,starttime,stoptime,tripduration,start_lat,start_lon,end_lat,end_lon
4692644,3,2015-01-06 01:59:59,2015-01-06 02:00:57,58,40.688210,-73.936020,40.690422,-73.936462
4692645,3,2015-01-06 01:59:59,2015-01-06 02:00:57,58,40.688210,-73.936020,40.690422,-73.936462
4692646,3,2015-01-06 01:59:59,2015-01-06 02:00:29,30,40.673885,-73.952827,40.675598,-73.952667
4692647,3,2015-01-06 01:59:59,2015-01-06 02:00:42,43,40.646023,-73.929893,40.644096,-73.929688
4692648,6,2015-01-06 01:59:59,2015-01-06 02:01:25,86,40.868080,-73.892540,40.870243,-73.890419

In [34]:
output_q1.to_csv("output-time/q1_raw.csv")

In [36]:
output_q2.to_csv("output-time/q2_raw.csv")
output_q3.to_csv("output-time/q3_raw.csv")
output_q4.to_csv("output-time/q4_raw.csv")

In [37]:
%%bash
cd output-time
awk -F"," -v OFS="," '{ $1="" ; $0=substr($0,2) } 1' q1_raw.csv > q1.csv
awk -F"," -v OFS="," '{ $1="" ; $0=substr($0,2) } 1' q2_raw.csv > q2.csv
awk -F"," -v OFS="," '{ $1="" ; $0=substr($0,2) } 1' q3_raw.csv > q3.csv
awk -F"," -v OFS="," '{ $1="" ; $0=substr($0,2) } 1' q4_raw.csv > q4.csv